app/Controllers/Admin.php

    public function dashboard()
    {
        // Mengambil data total supplier
        $data['totalSupplier'] = $this->supplierModel->countAllResults();

        // Mengambil data total barang
        $data['totalBarang'] = $this->barangModel->countAllResults();

        // Mengambil data total stok barang
        $data['totalStokBarang'] = $this->barangModel->selectSum('stok')->get()->getRow()->stok;

        // Mengambil data total barang terjual
        $data['totalBarangTerjual'] = $this->detailPenjualanModel->selectSum('qty')->get()->getRow()->qty;
---
SELECT COUNT(*) AS `numrows`
FROM `supplier`
SELECT COUNT(*) AS `numrows`
FROM `barang`
SELECT *
FROM `barang`
SELECT SUM(`stok`) AS `stok`
FROM `barang`
SELECT SUM(`qty`) AS `qty`
FROM `detail_penjualan`

    public function barang()
    {
        $barangModel = new Barang();
        $data['barang'] = $barangModel->findAll();
---
SELECT *
FROM `barang`

    public function pegawai()
    {
        $UsersModel = new Users();
        $data['Users'] = $UsersModel
            ->where('level', 'pegawai')
            ->findAll();
---
SELECT *
FROM `user`
WHERE `level` = 'pegawai'

    public function supplier()
    {
        $supplierModel = new Supplier();
        $data['suppliers'] = $supplierModel->findAll();
---
SELECT *
FROM `supplier`

    public function pembelian()
    {
        $db = \Config\Database::connect();

        // Query untuk mendapatkan data pembelian dengan informasi tambahan
        $query = $db->table('pembelian')
            ->select('pembelian.id_pembelian, pembelian.tgl_pembelian, supplier.nama_supplier, user.fullname as nama_user,
                      SUM(detail_pembelian.qty) as total_qty, SUM(detail_pembelian.qty * detail_pembelian.harga) as total_harga')
            ->join('supplier', 'pembelian.id_supplier = supplier.id_supplier', 'left')
            ->join('user', 'pembelian.id_user = user.id_user', 'left')
            ->join('detail_pembelian', 'pembelian.id_pembelian = detail_pembelian.id_pembelian', 'left')
            ->groupBy('pembelian.id_pembelian')
            ->get();
---
SELECT `pembelian`.`id_pembelian`, `pembelian`.`tgl_pembelian`, `supplier`.`nama_supplier`, `user`.`fullname` as `nama_user`, SUM(detail_pembelian.qty) as total_qty, SUM(detail_pembelian.qty * detail_pembelian.harga) as total_harga
FROM `pembelian`
LEFT JOIN `supplier` ON `pembelian`.`id_supplier` = `supplier`.`id_supplier`
LEFT JOIN `user` ON `pembelian`.`id_user` = `user`.`id_user`
LEFT JOIN `detail_pembelian` ON `pembelian`.`id_pembelian` = `detail_pembelian`.`id_pembelian`
GROUP BY `pembelian`.`id_pembelian`

    public function penjualan()
    {
        $db = \Config\Database::connect();

        // Query untuk mendapatkan data penjualan dengan informasi tambahan
        $query = $db->table('penjualan')
            ->select('penjualan.id_penjualan, penjualan.tgl_penjualan, penjualan.nama_pembeli, user.fullname as nama_user,
                      COUNT(detail_penjualan.kode_barang) as jumlah_barang,
                      SUM(detail_penjualan.qty * detail_penjualan.harga) as total_harga')
            ->join('user', 'penjualan.id_user = user.id_user', 'left')
            ->join('detail_penjualan', 'penjualan.id_penjualan = detail_penjualan.id_penjualan', 'left')
            ->groupBy('penjualan.id_penjualan')
            ->get();
---
SELECT `penjualan`.`id_penjualan`, `penjualan`.`tgl_penjualan`, `penjualan`.`nama_pembeli`, `user`.`fullname` as `nama_user`, COUNT(detail_penjualan.kode_barang) as jumlah_barang, SUM(detail_penjualan.qty * detail_penjualan.harga) as total_harga
FROM `penjualan`
LEFT JOIN `user` ON `penjualan`.`id_user` = `user`.`id_user`
LEFT JOIN `detail_penjualan` ON `penjualan`.`id_penjualan` = `detail_penjualan`.`id_penjualan`
GROUP BY `penjualan`.`id_penjualan`

    public function laporanStokBulan()
    {
        $detailPenjualanModel = new DetailPenjualan();
        $detailPembelianModel = new DetailPembelian();

        // Ambil semua data penjualan
        $penjualan = $detailPenjualanModel
            ->select('barang.kode_barang, barang.nama_barang, barang.brand, barang.stok, SUM(detail_penjualan.qty) as total_qty_penjualan')
            ->join('barang', 'barang.kode_barang = detail_penjualan.kode_barang')
            ->join('penjualan', 'detail_penjualan.id_penjualan = penjualan.id_penjualan')
            ->groupBy('barang.kode_barang')
            ->findAll();

        // Ambil semua data pembelian
        $pembelian = $detailPembelianModel
            ->select('barang.kode_barang, barang.nama_barang, barang.brand, barang.stok, SUM(detail_pembelian.qty) as total_qty_pembelian')
            ->join('barang', 'barang.kode_barang = detail_pembelian.kode_barang')
            ->join('pembelian', 'detail_pembelian.id_pembelian = pembelian.id_pembelian')
            ->groupBy('barang.kode_barang')
            ->findAll();
---
SELECT `barang`.`kode_barang`, `barang`.`nama_barang`, `barang`.`brand`, `barang`.`stok`, SUM(detail_penjualan.qty) as total_qty_penjualan
FROM `detail_penjualan`
JOIN `barang` ON `barang`.`kode_barang` = `detail_penjualan`.`kode_barang`
JOIN `penjualan` ON `detail_penjualan`.`id_penjualan` = `penjualan`.`id_penjualan`
GROUP BY `barang`.`kode_barang`
SELECT `barang`.`kode_barang`, `barang`.`nama_barang`, `barang`.`brand`, `barang`.`stok`, SUM(detail_pembelian.qty) as total_qty_pembelian
FROM `detail_pembelian`
JOIN `barang` ON `barang`.`kode_barang` = `detail_pembelian`.`kode_barang`
JOIN `pembelian` ON `detail_pembelian`.`id_pembelian` = `pembelian`.`id_pembelian`
GROUP BY `barang`.`kode_barang`