app/Controllers/Auth.php

    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $userModel = new Users();
            $user = $userModel->where('username', $username)->first();

            // Validasi username
            if (!$user) {
                return redirect()->back()->with('error', 'Username tidak terdaftar.');
            }

            // Validasi password
            if ($user && !password_verify($password, $user['password'])) {
                return redirect()->back()->with('error', 'Password yang dimasukkan salah.');
            }

            // Update kolom last_login
            $userModel->update($user['id_user'], [
                'last_login' => date('Y-m-d H:i:s')
            ]);
---
SELECT *
FROM `user`
WHERE `username` = 'pegawai'
 LIMIT 1
UPDATE `user` SET `last_login` = '2025-01-10 13:33:06'
WHERE `user`.`id_user` IN ('4')