app/Controllers/Pegawai.php

SELECT COUNT(*) AS `numrows`
FROM `supplier`
SELECT COUNT(*) AS `numrows`
FROM `barang`
SELECT SUM(`qty`) AS `qty`
FROM `detail_penjualan`
---
    public function dashboard()
    {
        $data['totalSupplier'] = $this->supplierModel->countAllResults();
        $data['totalBarang'] = $this->barangModel->countAllResults();
        $data['totalStokBarang'] = $this->barangModel->selectSum('stok')->get()->getRow()->stok;
        $data['totalBarangTerjual'] = $this->detailPenjualanModel->selectSum('qty')->get()->getRow()->qty;

SELECT *
FROM `barang`
---
    public function barang()
    {
        $barangModel = new Barang();
        $data['barang'] = $barangModel->findAll();

SELECT `penjualan`.`id_penjualan`, `penjualan`.`tgl_penjualan`, `penjualan`.`nama_pembeli`, `user`.`fullname` as `nama_user`, COUNT(detail_penjualan.kode_barang) as jumlah_barang, SUM(detail_penjualan.qty * detail_penjualan.harga) as total_harga
FROM `penjualan`
LEFT JOIN `user` ON `penjualan`.`id_user` = `user`.`id_user`
LEFT JOIN `detail_penjualan` ON `penjualan`.`id_penjualan` = `detail_penjualan`.`id_penjualan`
GROUP BY `penjualan`.`id_penjualan`
---
    public function penjualan()
    {
        $db = \Config\Database::connect();

        $query = $db->table('penjualan')
            ->select('penjualan.id_penjualan, penjualan.tgl_penjualan, penjualan.nama_pembeli, user.fullname as nama_user,
                      COUNT(detail_penjualan.kode_barang) as jumlah_barang,
                      SUM(detail_penjualan.qty * detail_penjualan.harga) as total_harga')
            ->join('user', 'penjualan.id_user = user.id_user', 'left')
            ->join('detail_penjualan', 'penjualan.id_penjualan = detail_penjualan.id_penjualan', 'left')
            ->groupBy('penjualan.id_penjualan')
            ->get();